# 1. Берем за основу готовый Linux с Python 3.10
FROM python:3.10-slim

# 2. Отключаем создание мусора (.pyc файлов) и буферизацию вывода (чтобы логи видеть сразу)
ENV PYTHONDONTWRITEBYTECODE 1
ENV PYTHONUNBUFFERED 1

# 3. Создаем папку /app внутри контейнера и переходим в нее
WORKDIR /app

# 4. Копируем файл зависимостей внутрь контейнера
COPY requirements.txt .

# 5. Устанавливаем библиотеки
RUN pip install -r requirements.txt

# 6. Копируем ВЕСЬ твой проект внутрь контейнера
COPY . .

# 7. Говорим, какую команду запустить при старте (запуск сервера)
# 0.0.0.0 значит "слушай внешние запросы", а не только внутри контейнера
CMD ["python", "manage.py", "runserver", "0.0.0.0:8000"]